In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("../Dataset/enrollment_info.csv")
print(df.dtypes)
print(df.shape)
df.head()

enrollment_code     object
gender              object
bonus              float64
penalty            float64
school_code         object
dtype: object
(86550, 5)

  enrollment_code gender  bonus  penalty school_code
0          QEHRNZ      F    0.0      0.0        SWHS
1          IUGTFR      F    1.6      0.0        PYHS
2          PWJCQA      M    0.0      0.0        NKHS
3          ZYFHCX      F    5.5      0.0        NKHS
4          KIBAHX      M    0.6      0.0        MWHS

#단계 1 : 각 학생들의 상점(bonus)에서 벌점(penalty)을 뺀 값을 합계 점수로 정의한다.

In [5]:
df_q1 = df
df_q1['score'] = df_q1['bonus']-df_q1['penalty']
df_q1.tail()

      enrollment_code gender  bonus  penalty school_code  score
86545          EPQLIH      M    1.6      0.5        MWHS    1.1
86546          MQXDDG      M    0.9      1.5        SWHS   -0.6
86547          HJXJMX      F    0.1      0.0        MWHS    0.1
86548          RNRPTP      M    1.0      1.5        SSHS   -0.5
86549          MWFMAZ      M    1.6      0.0        PYHS    1.6

#단계 2 : 각 학교 코드(school_code)별 합계 점수 평균을 구하고, 이 중 3번째로 큰 값을 A라고 한다.

In [20]:
group1 = df_q1.groupby(['school_code'])['score'].mean()
group1

school_code
HJHS    1.903893
MWHS    1.884921
NKHS    1.884758
PYHS    1.894385
SSHS    1.878692
SWHS    1.885445
Name: score, dtype: float64

In [9]:
A = 1.885445

In [26]:
df_q1['score'] = np.where(df_q1['score']<0, 0, df_q1['score'])

In [27]:
df_q1.tail()

      enrollment_code gender  bonus  penalty school_code  score
86545          EPQLIH      M    1.6      0.5        MWHS    1.1
86546          MQXDDG      M    0.9      1.5        SWHS    0.0
86547          HJXJMX      F    0.1      0.0        MWHS    0.1
86548          RNRPTP      M    1.0      1.5        SSHS    0.0
86549          MWFMAZ      M    1.6      0.0        PYHS    1.6

In [28]:
group2 = df_q1.groupby(['school_code'])['score'].mean()
group2

school_code
HJHS    1.975478
MWHS    1.951009
NKHS    1.955182
PYHS    1.961894
SSHS    1.946607
SWHS    1.954195
Name: score, dtype: float64

In [29]:
B = 1.955182

In [32]:
answer = abs(A-B)
print(answer)

0.06973699999999994

In [35]:
print(round(answer, 1))

0.1

In [37]:
answer  = round(answer, 1)
answer

0.1

In [38]:
#Q2

In [39]:
df.head()

  enrollment_code gender  bonus  penalty school_code  score
0          QEHRNZ      F    0.0      0.0        SWHS    0.0
1          IUGTFR      F    1.6      0.0        PYHS    1.6
2          PWJCQA      M    0.0      0.0        NKHS    0.0
3          ZYFHCX      F    5.5      0.0        NKHS    5.5
4          KIBAHX      M    0.6      0.0        MWHS    0.6

In [49]:
school_codes = df['school_code'].unique()
school_codes

array(['SWHS', 'PYHS', 'NKHS', 'MWHS', 'SSHS', 'HJHS'], dtype=object)

In [50]:
school_codes = ['SWHS', 'PYHS', 'NKHS', 'MWHS', 'SSHS', 'HJHS']
school_codes

['SWHS', 'PYHS', 'NKHS', 'MWHS', 'SSHS', 'HJHS']

In [52]:
for code in school_codes:
    print(code)

SWHS
PYHS
NKHS
MWHS
SSHS
HJHS

In [57]:
import string

In [84]:
sum = 0
for code in school_codes:
    print(code)
    count = np.where((df['enrollment_code'].str.contains(code))==True, 1, 0)
    print(code, count.sum())
    sum+=count.sum()

SWHS
SWHS 2
PYHS
PYHS 0
NKHS
NKHS 0
MWHS
MWHS 0
SSHS
SSHS 1
HJHS
HJHS 0

In [85]:
answer = sum
answer

3

In [120]:
df_q3 = pd.read_csv("../Dataset/enrollment_info.csv")
df_q3.head()

  enrollment_code gender  bonus  penalty school_code
0          QEHRNZ      F    0.0      0.0        SWHS
1          IUGTFR      F    1.6      0.0        PYHS
2          PWJCQA      M    0.0      0.0        NKHS
3          ZYFHCX      F    5.5      0.0        NKHS
4          KIBAHX      M    0.6      0.0        MWHS

In [121]:
droptarget = df_q3[df_q3['enrollment_code'].str.contains('HS')==False].index
droptarget

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            86540, 86541, 86542, 86543, 86544, 86545, 86546, 86547, 86548,
            86549],
           dtype='int64', length=85889)

In [122]:
df_q3.drop(droptarget, inplace=True)

In [123]:
df_q3.head()
df_q3.shape

(661, 5)

In [124]:
df_q3

      enrollment_code gender  bonus  penalty school_code
212            HSJZSV      F    2.7      0.0        NKHS
352            GHSBRB      M    1.7      0.0        PYHS
466            QCMHSO      M    1.9      0.0        HJHS
515            QCUGHS      F    0.6      0.0        PYHS
825            VFEHSR      F    0.0      1.0        HJHS
...               ...    ...    ...      ...         ...
85724          KLHSJF      F    0.8      0.0        MWHS
86186          VHSEHU      M    1.1      0.0        HJHS
86314          IAHSSZ      M    1.2      2.0        SSHS
86452          KZHSZY      F    1.4      0.0        SWHS
86502          CUDHSP      M    0.9      0.0        SSHS

[661 rows x 5 columns]

In [126]:
df_q3['gender'] = np.where(df_q3['gender'] == 'F', 1, 0)

In [127]:
df_q3

      enrollment_code  gender  bonus  penalty school_code
212            HSJZSV       1    2.7      0.0        NKHS
352            GHSBRB       0    1.7      0.0        PYHS
466            QCMHSO       0    1.9      0.0        HJHS
515            QCUGHS       1    0.6      0.0        PYHS
825            VFEHSR       1    0.0      1.0        HJHS
...               ...     ...    ...      ...         ...
85724          KLHSJF       1    0.8      0.0        MWHS
86186          VHSEHU       0    1.1      0.0        HJHS
86314          IAHSSZ       0    1.2      2.0        SSHS
86452          KZHSZY       1    1.4      0.0        SWHS
86502          CUDHSP       0    0.9      0.0        SSHS

[661 rows x 5 columns]

In [129]:
from sklearn.cluster import KMeans
from sklearn.metrics import silhouette_score
random_state = 229

In [141]:
X = df_q3[['gender', 'bonus', 'penalty']]
for k in range(2, 10):
    model = KMeans(n_clusters=k, random_state=229)
    model.fit(X)
    score = silhouette_score(X, model.labels_, random_state=229)
    print(k, score)

2 0.49210569817087274
3 0.4062931935890039
4 0.3673405058072259
5 0.3788434967209334
6 0.3819707893922239
7 0.39566832687844056
8 0.40860930605877754
9 0.40552123066025897

In [142]:
K = 8

In [144]:
model = KMeans(n_clusters=K, random_state=229)
model.fit(X)
score = silhouette_score(X, model.labels_, random_state=229)
score

0.40860930605877754

In [147]:
df_q3['label'] = model.labels_

In [148]:
df_q3.head()

    enrollment_code  gender  bonus  penalty school_code  label
212          HSJZSV       1    2.7      0.0        NKHS      4
352          GHSBRB       0    1.7      0.0        PYHS      0
466          QCMHSO       0    1.9      0.0        HJHS      0
515          QCUGHS       1    0.6      0.0        PYHS      2
825          VFEHSR       1    0.0      1.0        HJHS      5

In [149]:
df_q3.groupby(['label']).count()

       enrollment_code  gender  bonus  penalty  school_code
label
0                   98      98     98       98           98
1                   62      62     62       62           62
2                   84      84     84       84           84
3                   81      81     81       81           81
4                  102     102    102      102          102
5                   36      36     36       36           36
6                   94      94     94       94           94
7                  104     104    104      104          104

In [150]:
answer = 104/661
answer

0.1573373676248109

In [151]:
answer = round(answer, 2)
answer

0.16